{
  "filmes": [
    {
      "id": 1,
      "nome": "Interestelar",
      "valor": 49.90,
      "descricao": "Com a Terra à beira do colapso, um ex-piloto da NASA é recrutado para uma missão espacial secreta que busca um novo planeta habitável para a humanidade. Viajando por um buraco de minhoca, ele e sua equipe enfrentam mundos desconhecidos, desafios extremos e dilemas emocionais enquanto o tempo passa de forma diferente para quem está no espaço e quem ficou na Terra. O filme mistura ciência, drama e a força dos laços humanos.",
      "imagem": "https://comunica.ufu.br/sites/comunica.ufu.br/files/conteudo/noticia/imagem_destaque_99.jpg"
    },
    {
      "id": 2,
      "nome": "Gente Grande",
      "valor": 34.90,
      "descricao": "Após a morte do treinador da infância, cinco amigos se reencontram com suas famílias para passar um fim de semana em uma casa no lago. Entre situações engraçadas e momentos caóticos, eles revivem lembranças da juventude, fortalecem suas amizades e aprendem lições sobre família, maturidade e simplicidade da vida.",
      "imagem": "https://m.media-amazon.com/images/S/pv-target-images/b71b06873fb90830776f41793940dddf06e5f38de22aa19e456d1aa3e1da483f.jpg"
    },
    {
      "id": 3,
      "nome": "Vingadores Ultimato",
      "valor": 29.90,
      "descricao": "Após o devastador estalo de Thanos, os Vingadores sobreviventes se unem para tentar reverter o caos e trazer de volta aqueles que foram perdidos. Eles embarcam em uma missão arriscada envolvendo viagens no tempo para recuperar as Joias do Infinito antes de Thanos, enfrentando batalhas épicas e tomando decisões que mudam para sempre o destino do universo.",
      "imagem": "https://disney.images.edge.bamgrid.com/ripcut-delivery/v2/variant/disney/a01393ab-13bb-415b-a830-4188ec50fb31/compose?aspectRatio=1.78&format=webp&width=1200"
    },
    {
      "id": 4,
      "nome": "Dragon Ball Z: O Retorno de Cooler",
      "valor": 19.90,
      "descricao": "Cooler retorna como um robô e escraviza a população de Nova Namek. Goku e seu grupo devem ajudar.",
      "imagem": "https://i.ytimg.com/vi/Iowqrcqp45M/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLDvr9QTL9_vWhleNxBygQbmSgEAZA"
    },
        {
      "id": 5,
      "nome": "Five Nights At Freddy's 2",
      "valor": 34.90,
      "descricao": "Baseada no famoso jogo de terror de sobrevivência do ano de 2014, Five Nights at Freddy's 2 é o futuro filme da Blumhouse Productions e continuação direta de sua primeira produção estrelado por Josh Hutcherson. O filme é dirigido por Emma Tammi e escrito por Scott Cawthon e Seth Grahame-Smith.",
      "imagem": "https://i.ytimg.com/vi/BAuX9jfAtlQ/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLDJ7hXWOvMcr_l3m9NNZXMLnKtrSQ"
    },
    {
      "id": 6,
      "nome": "Star Wars - Episódio III: A Vingança dos Sith",
      "valor": 39.90,
      "descricao": "A República está em guerra contra os separatistas. Enquanto isso, o jovem Jedi Anakin Skywalker luta com seus medos, visões e a crescente influência do Chanceler Palpatine, que secretamente é o Lorde Sith Darth Sidious.Manipulado pelos temores de perder Padmé, Anakin gradualmente abandona os Jedi e se torna Darth Vader, contribuindo para a queda da Ordem Jedi e o surgimento do Império Galáctico.",
      "imagem": "https://disney.images.edge.bamgrid.com/ripcut-delivery/v2/variant/disney/3a3c6316-74c2-436b-ac94-9ca61e1e555c/compose?aspectRatio=1.78&format=webp&width=1200"
    },
        {
      "id": 7,
      "nome": "Homem-Aranha: Sem Volta para Casa ",
      "valor": 9.90,
      "descricao": "Depois de sua identidade ser revelada ao mundo, Peter Parker pede ajuda ao Doutor Estranho para fazer o mundo esquecer que ele é o Homem-Aranha.O feitiço dá errado e abre brechas no multiverso, trazendo vilões de outros universos — incluindo Duende Verde, Doutor Octopus, Electro e outros.Peter então precisa lidar com as consequências da bagunça e com decisões dolorosas que o transformam em um herói mais maduro.",
      "imagem": "https://disneyplusbrasil.com.br/wp-content/uploads/2021/03/Homem-Aranha-3-Vilao-1024x576.jpg"
    },
    {
      "id": 8,
      "nome": "Whiplash - Em Busca da Perfeição ",
      "valor": 39.90,
      "descricao": "Andrew Neiman é um jovem baterista talentoso que entra para a melhor escola de música dos EUA. Lá, ele chama a atenção de Terence Fletcher, um professor extremamente exigente e abusivo. Fletcher coloca Andrew sob pressão psicológica e física para levar seus alunos ao limite da perfeição, transformando o sonho de Andrew em uma batalha mental intensa.",
      "imagem": "https://www.nandopires.com.br/blog/wp-content/arquivos/2015/05/Whiplash.jpg"
    }
  ]
}